### Extraire STR -> numérique

On utilise la fonction .astype() pour changer le type de notre colonne

#### Exemple n°1

In [23]:
import pandas as pd
chem = "https://bit.ly/bitcoin-purchases"

In [24]:
df = pd.read_csv(chem)
df.shape

(1000, 3)

In [25]:
df.dtypes

bitcoin address    object
wire amount        object
credit card         int64
dtype: object

In [26]:
df.head()

                      bitcoin address wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126

In [29]:
df['wire amount'] = df['wire amount'].str.replace('$','').astype('float')

In [30]:
df.head()

                      bitcoin address  wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ      2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU      4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE      6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u      6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp      3759.40     5349906235596126

In [31]:
df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

#### Exemple n°2

Ici on cherche à remplacer les "," par des "." et de retirer le 1er caractère de chaque lignes de "wire amount" tout en conservant la devise.

In [39]:
chem = "https://bit.ly/bitcoin-purchases2"
df = pd.read_csv(chem)
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [40]:
df['wire amount'] = df['wire amount'].str.replace(',','.')
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

#### 1) Extraction de la devise et ajout d'une nouvelle colonne

In [42]:
df['devise'] = df['wire amount'].str[0]

#### 2) Suppression de la devise dans wire amount

Méthode 1

In [46]:
df['wire amount'] = df['wire amount'].str[1:].astype('float')

Méthode 2

In [44]:
df['wire amount'].str.slice(1, None).astype('float')

0      8356.92
1       311.06
2      2032.44
3      8155.74
4      3265.44
        ...
995     844.68
996    1433.63
997    3814.11
998    2900.85
999    1587.16
Name: wire amount, Length: 1000, dtype: object

Résultat

In [47]:
df.head()

                      bitcoin address  wire amount       credit card devise
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe      8356.92  3543456448666398      £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       311.06  3584615208479876      €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      2032.44  6370577480710876      €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6      8155.74  4508652385157398      ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ      3265.44   374622922103592      £

## EXO 1

In [97]:
import random
import pandas as pd
def makeNumberStr(sep=[',']):
    avantVirgule = str(random.randint(1,1000))
    apresVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    return avantVirgule + sep + apresVirgule
col1 = [makeNumberStr() for _ in range(200)]
col2 = [makeNumberStr(['.',',']) for _ in range(200)]

exo1 = pd.DataFrame(data={'col1' : col1,
                           'col2' : col2})

In [98]:
exo1.shape

(200, 2)

In [99]:
exo1.dtypes

col1    object
col2    object
dtype: object

In [100]:
exo1.head()

     col1    col2
0  806,75  517.42
1  652,88  609,80
2  441,88   85.41
3  818,40  649,21
4   35,79  983.93

In [101]:
exo1.tail()

       col1    col2
195  297,61  563,18
196  931,32  771,03
197  823,31  774.89
198  397,13   71,66
199  976,75  137,72

In [102]:
exo1['col1'] = exo1['col1'].str.replace(',','.').astype('float')

In [104]:
exo1['col2'] = exo1['col2'].str.replace(',','.').astype('float')

In [105]:
exo1.head()

     col1    col2
0  806.75  517.42
1  652.88  609.80
2  441.88   85.41
3  818.40  649.21
4   35.79  983.93

## EXO 2

In [139]:
import random

def makeNumberStrRandSign(sep=[','], signs=['€', '$']):
    avantVirgule = str(random.randint(1,1000))
    apresVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantVirgule + sep + apresVirgule + sign
col1 = [makeNumberStrRandSign() for _ in range(200)]
col2 = [makeNumberStrRandSign(['.',',']) for _ in range(200)]

exo2 = pd.DataFrame(data={'col1' : col1,
                           'col2' : col2})

In [140]:
exo2.shape

(200, 2)

In [141]:
exo2.dtypes

col1    object
col2    object
dtype: object

In [142]:
exo2.head()

      col1     col2
0  635,99$  947.99€
1  968,14€  766.64€
2  896,34€  659.12$
3   47,88€   87.33€
4  606,74€  299.44€

In [143]:
exo2.tail()

        col1     col2
195  921,75€  218.31€
196  497,81€  644.78€
197   79,12€  553.52$
198  656,07€  993.53$
199   36,66$  922.52$

In [144]:
exo2['devise col1'] = exo2['col1'].str[-1]

In [145]:
exo2['devise col2'] = exo2['col2'].str[-1]

In [146]:
exo2.head()

      col1     col2 devise col1 devise col2
0  635,99$  947.99€           $           €
1  968,14€  766.64€           €           €
2  896,34€  659.12$           €           $
3   47,88€   87.33€           €           €
4  606,74€  299.44€           €           €

In [150]:
exo2['col1'] = exo2['col1'].str[:-1].str.replace(',','.').astype('float')

In [151]:
exo2['col2'] = exo2['col2'].str[:-1].str.replace(',','.').astype('float')

In [152]:
exo2.head()

    col1   col2 devise col1 devise col2
0  635.9  947.9           $           €
1  968.1  766.6           €           €
2  896.3  659.1           €           $
3   47.8   87.3           €           €
4  606.7  299.4           €           €

In [153]:
exo2.dtypes

col1           float64
col2           float64
devise col1     object
devise col2     object
dtype: object

## Solution EXO 2

### Dans une version 1 par 1

In [161]:
import random

def makeNumberStrRandSign(sep=[','], signs=['€', '$']):
    avantVirgule = str(random.randint(1,1000))
    apresVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantVirgule + sep + apresVirgule + sign
col1 = [makeNumberStrRandSign() for _ in range(200)]
col2 = [makeNumberStrRandSign(['.',',']) for _ in range(200)]

exo2 = pd.DataFrame(data={'col1' : col1,
                           'col2' : col2})

In [162]:
exo2['col1'] = exo2['col1'].str.replace(',','.')
exo2['col2'] = exo2['col2'].str.replace(',','.')
exo2['Devise col1'] = exo2['col1'].str.get(-1)
exo2['col1'] = exo2['col1'].str.slice(None,-1).astype('float')
exo2['Devise col2'] = exo2['col2'].str.get(-1)
exo2['col2'] = exo2['col2'].str.slice(None,-1).astype('float')

In [164]:
exo2.head()

     col1    col2 Devise col1 Devise col2
0  534.39  394.86           €           $
1  333.13  230.08           $           €
2  855.49   18.66           €           $
3  650.45  140.30           $           $
4  371.98  470.97           $           $

### Sous forme de boucle

In [155]:
import random

def makeNumberStrRandSign(sep=[','], signs=['€', '$']):
    avantVirgule = str(random.randint(1,1000))
    apresVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantVirgule + sep + apresVirgule + sign
col1 = [makeNumberStrRandSign() for _ in range(200)]
col2 = [makeNumberStrRandSign(['.',',']) for _ in range(200)]

exo2 = pd.DataFrame(data={'col1' : col1,
                           'col2' : col2})

In [157]:
for i in [1,2] :
    exo2[f'col{i}'] = exo2[f'col{i}'].str.replace(',','.')
    exo2[f'Devise col{i}'] = exo2[f'col{i}'].str.get(-1)
    exo2[f'col{i}'] = exo2[f'col{i}'].str.slice(None,-1).astype('float')

In [160]:
exo2.head()

     col1    col2 Devise col1 Devise col2
0   39.15  120.47           €           €
1  320.87   27.14           $           $
2  523.00  863.11           $           €
3  271.03  504.35           €           €
4  534.14  446.55           $           $